'''
Вивчіть основні стандартні винятки, які перераховані в цьому уроці.
'''
'''
Клас Опис
BaseException               Базовий клас для всіх винятків.
Exception                   Базовий клас для всіх стандартних винятків, які не вказують
                            на обов'язкове завершення програми, та всіх
                            користувацьких винятків.
ArithmeticError             Базовий клас для всіх винятків, які пов'язані з
                            арифметичними операціями.
BufferError                 Базовий клас для винятків, які пов'язані з операціями над
                            буфером.
LookupError                 Базовий клас для винятків, які пов'язані з неправильним
                            ключем або індексом колекції.
StandardError (Python 2)    Базовий клас для всіх вбудованих винятків, окрім
                            StopIteration, GeneratorExit, KeyboardInterrupt та SystemExit.
EnvironmentError (Python 2) Базовий клас для винятків, які пов'язані з помилками, що
                            виникають поза інтерпретатором Python.

'''