'''
Створіть програму спортивного комплексу, у якій передбачене меню:
1 - перелік видів спорту,
2 - команда тренерів,
3 - розклад тренувань,
4 - вартість тренування.
Дані зберігати у словниках.
Також передбачити пошук по прізвищу тренера, яке вводиться з клавіатури у відповідному пункті меню.
 Якщо ключ не буде знайдений, створити відповідний клас-Exception, який буде викликатися в обробнику виключень.
'''
#власний вийняток для пошуку тренера
class TrainerNotFoundError(Exception):
    pass

def show_sports(sports):
    print("\n Перелік видів спорту")
    for sport in sports:
        print(f"  - { sport}")

def show_trainers(trainers):
    print("\n Список тренерів")
    for surname, info in trainers.items():
        print(f"- {info['імʼя']} {surname}, вид спорту {info['спорт']}")
    search = input("\n введіть прізвище тренера для пошуку:  ").capitalize()
    try:
        if search not in trainers:
            raise TrainerNotFoundError(f" Тренера з таким прізвищем не знайдено")
        trainer=trainers[search]
        print(f"\n Знайдено {trainer['імʼя']} {search}, вид спорту: {trainer['спорт']}")
    except TrainerNotFoundError as e:
        print(f" Помилка {e}")


def show_schedule(scedule):
    print("\n Розклад занять")
    for sport,time in scedule.items():
        print(f"  - { sport} : {time}")

def show_prices(prices):
    print("\n Вартість тренувань:")
    for sport, price in prices.items():
        print(f"- {sport}: {price} грн/заняття")


def main():
    # Словники даних
    sports = ["Футбол", "Баскетбол", "Гандбол", "Теніс", "Бамбінтон", "Легка атлетика", "Важка атлетика"]

    trainers = {
        "Петренко": {"імʼя": "Іван", "спорт": "Футбол"},
        "Сидоренко": {"імʼя": "Марина", "спорт": "Баскетбол"},
        "Коваль": {"імʼя": "Олег", "спорт": "Гандбол"},
        "Коваленко": {"імʼя": "Дмитро", "спорт": "Теніс"},
        "Остапенко": {"імʼя": "Василь", "спорт": "Бамбінтон"},
        "Микитенко": {"імʼя": "Пилип", "спорт": "Легка атлетика"},
        "Іваненко": {"імʼя": "Захар", "спорт": "Важка атлетика"},
    }

    scedule = {
        "Футбол": "Пн, Ср, Пт о 18:00",
        "Баскетбол": "Вт, Чт о 17:00",
        "Гандбол": "Вт, Чт о 19:00",
        "Теніс": "Пн, Ср, Пт о 16:00",
        "Бамбінтон": "Щодня о 08:00",
        "Легка атлетика": "Пн, Ср, Пт о 19:00",
        "Важка атлетика": "Вт, Чт о 16:00",
    }
    prices = {
        "Футбол": 150,
        "Баскетбол": 300,
        "Гандбол": 100,
        "Теніс": 250,
        "Бамбінтон": 50,
        "Легка атлетика": 125,
        "Важка атлетика": 175,
    }

    #Головне меню
    while True:
        print("n\Меню спортивного комплексу: ")
        print(" 1 - перелік видів спорту")
        print(" 2 - команда тренерів")
        print(" 3 - розклад тренувань")
        print(" 4 - вартість тренування")
        print(" 0 - вихід")

        choice = input ("Виберіть пункт меню: ")

        if choice == "1":
            show_sports(sports)
        elif choice == "2":
            show_trainers(trainers)
        elif choice == "3":
            show_schedule(scedule)
        elif choice == "4":
            show_prices(prices)
        elif choice == "0":
            print ("До побачення")
            break
        else:
            print("Не вірний вибір, спробуйте ще раз")

if __name__ == "__main__":
    main()